src/ai-operator/InformationRegisters/ИИО_МаскируемыеПоля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИИО_МаскируемыеПоля</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидПДн</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Условие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ai-operator/CommonModules/ИИО_Маскирование/Ext/Module.bsl
// Определение персональных данных в ответах инструментов.
// Сервер только помечает ПДн, токены выдает клиентское ядро: словарь живет в памяти клиентского сеанса.

#Область СлужебныйПрограммныйИнтерфейс

// Виды ПДн для ссылок: какие представления ссылок нужно маскировать.
//
// Параметры:
//  Ссылки - Массив из ЛюбаяСсылка
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - ЛюбаяСсылка - Ссылка с ПДн.
//   * Значение - Строка - Вид ПДн (ФИО и т.п.).
Функция ВидыПДнСсылок(Ссылки) Экспорт

	Результат = Новый Соответствие;
	Правила = ИИО_МаскированиеПовтИсп.Правила();
	Для Каждого КлючИЗначение Из СсылкиПоОбъектам(Ссылки) Цикл
		Правило = Правила.Получить(КлючИЗначение.Ключ);
		Если Правило = Неопределено Или Не ЗначениеЗаполнено(Правило.ВидСсылки) Тогда
			Продолжить;
		КонецЕсли;
		БезПДн = ?(ЗначениеЗаполнено(Правило.Условие),
			СсылкиБезПДн(КлючИЗначение.Ключ, Правило.Условие, КлючИЗначение.Значение),
			Новый Соответствие);
		Для Каждого Ссылка Из КлючИЗначение.Значение Цикл
			Если БезПДн.Получить(Ссылка) = Неопределено Тогда
				Результат.Вставить(Ссылка, Правило.ВидСсылки);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Вид ПДн поля объекта или пустая строка, если поле не содержит ПДн.
// У объекта с условием (контрагенты: только физлица и ИП) вид условный, см. РазрешитьУсловныеПометки.
//
// Параметры:
//  ПолноеИмяОбъекта - Строка - Например, Справочник.Контрагенты.
//  ИмяПоля - Строка - Имя реквизита или измерения.
//
// Возвращаемое значение:
//  Строка - «ИНН» или условный вид «ИНН|Справочник.Контрагенты|ИНН».
Функция ВидПДнПоля(ПолноеИмяОбъекта, ИмяПоля) Экспорт

	Правило = ИИО_МаскированиеПовтИсп.Правила().Получить(ПолноеИмяОбъекта);
	Если Правило = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	Вид = Правило.Поля.Получить(ИмяПоля);
	Если Вид = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	Возврат ?(ЗначениеЗаполнено(Правило.Условие), УсловныйВидПДн(Вид, ПолноеИмяОбъекта, ИмяПоля), Вид);

КонецФункции

// Вид ПДн представления ссылок на объект или пустая строка. Для объекта с условием ссылки проверяет построчно
// ВидыПДнСсылок, а строковое представление (ПРЕДСТАВЛЕНИЕ(Т.Контрагент)) получает условный вид по наименованию.
//
// Параметры:
//  ПолноеИмяОбъекта - Строка - Например, Справочник.ФизическиеЛица.
//
// Возвращаемое значение:
//  Строка
Функция ВидПДнСсылки(ПолноеИмяОбъекта) Экспорт

	Правило = ИИО_МаскированиеПовтИсп.Правила().Получить(ПолноеИмяОбъекта);
	Если Правило = Неопределено Или Не ЗначениеЗаполнено(Правило.ВидСсылки) Тогда
		Возврат "";
	ИначеЕсли Не ЗначениеЗаполнено(Правило.Условие) Тогда
		Возврат Правило.ВидСсылки;
	КонецЕсли;
	Возврат УсловныйВидПДн(Правило.ВидСсылки, ПолноеИмяОбъекта, "Наименование");

КонецФункции

// Вид ПДн без условия: «ИНН» для «ИНН|Справочник.Контрагенты|ИНН».
//
// Параметры:
//  Вид - Строка - Вид ПДн, в том числе условный.
//
// Возвращаемое значение:
//  Строка
Функция ОсновнойВидПДн(Вид) Экспорт

	Позиция = СтрНайти(Вид, "|");
	Возврат ?(Позиция = 0, Вид, Лев(Вид, Позиция - 1));

КонецФункции

// Вид ПДн значения, собранного из нескольких полей: части объединения, поля выражения, составной тип.
// Безусловный вид важнее условного. Условные виды разных полей дают безусловный:
// по значению не определить, из какого поля оно пришло.
//
// Параметры:
//  Вид - Строка
//  ДругойВид - Строка
//
// Возвращаемое значение:
//  Строка
Функция ОбъединитьВидыПДн(Вид, ДругойВид) Экспорт

	Если Не ЗначениеЗаполнено(Вид) Тогда
		Возврат ДругойВид;
	ИначеЕсли Не ЗначениеЗаполнено(ДругойВид) Или Вид = ДругойВид Тогда
		Возврат Вид;
	ИначеЕсли ЭтоУсловныйВид(Вид) И ЭтоУсловныйВид(ДругойВид) Тогда
		Возврат ОсновнойВидПДн(Вид);
	КонецЕсли;
	Возврат ?(ЭтоУсловныйВид(Вид), ДругойВид, Вид);

КонецФункции

// Заменяет пометки {"pii", "value"} с условным видом. Значение, которое встречается только у объектов без ПДн
// (наименование или ИНН юрлица), открывается, остальные получают основной вид ПДн.
// Объекты проверяются в привилегированном режиме: значение, общее с недоступным пользователю физлицом,
// не откроется. Значение, которого нет в поле объекта (склейка, подстрока), остается скрытым.
//
// Параметры:
//  Данные - Структура, Соответствие, Массив - Ответ из ИИО_Ответ.ДанныеДляМодели, меняется на месте.
Процедура РазрешитьУсловныеПометки(Данные) Экспорт

	Пометки = Новый Массив;
	СобратьУсловныеПометки(Данные, Пометки);
	Если Пометки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ЗначенияПоВидам = Новый Соответствие;
	Для Каждого Пометка Из Пометки Цикл
		Значения = ЗначенияПоВидам.Получить(Пометка.Вид);
		Если Значения = Неопределено Тогда
			Значения = Новый Массив;
			ЗначенияПоВидам.Вставить(Пометка.Вид, Значения);
		КонецЕсли;
		Если Значения.Найти(Пометка.Значение) = Неопределено Тогда
			Значения.Добавить(Пометка.Значение);
		КонецЕсли;
	КонецЦикла;
	ОткрытыеПоВидам = Новый Соответствие;
	Для Каждого КлючИЗначение Из ЗначенияПоВидам Цикл
		Части = СтрРазделить(КлючИЗначение.Ключ, "|");
		ОткрытыеПоВидам.Вставить(КлючИЗначение.Ключ, ОткрытыеЗначения(Части[1], Части[2], КлючИЗначение.Значение));
	КонецЦикла;

	Для Каждого Пометка Из Пометки Цикл
		Если ОткрытыеПоВидам.Получить(Пометка.Вид).Получить(Пометка.Значение) = Истина Тогда
			НовоеЗначение = Пометка.Значение;
		Иначе
			НовоеЗначение = Новый Структура("pii, value", ОсновнойВидПДн(Пометка.Вид), Пометка.Значение);
		КонецЕсли;
		Если ТипЗнч(Пометка.Контейнер) = Тип("Массив") Тогда
			Пометка.Контейнер.Установить(Пометка.Ключ, НовоеЗначение);
		Иначе
			Пометка.Контейнер.Вставить(Пометка.Ключ, НовоеЗначение);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// ПДн, которые могут встретиться в текстах ошибок и предупреждений по объектам: ссылки на людей в реквизитах
// шапки и табличных частей (контрагент-физлицо, ответственный, сотрудники), строковые реквизиты с ПДн
// и текущий пользователь. Ответ кладет их под ключ pii_context: клиентское ядро выдаст им токены
// и заменит их в свободном тексте, а сам ключ модели не уйдет.
//
// Параметры:
//  Объекты - Массив из ЛюбаяСсылка - Объекты, по которым есть тексты ошибок.
//
// Возвращаемое значение:
//  Массив из ЛюбаяСсылка, Структура - Ссылки и значения {"pii", "value"} для ИИО_Ответ.ДанныеДляМодели.
Функция КонтекстПДн(Объекты) Экспорт

	Контекст = Новый Массив;
	Если Объекты.Количество() = 0 Тогда
		Возврат Контекст;
	КонецЕсли;
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Если ЗначениеЗаполнено(ВидПДнСсылки(ТекущийПользователь.Метаданные().ПолноеИмя())) Тогда
		Контекст.Добавить(ТекущийПользователь);
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	Для Каждого КлючИЗначение Из СсылкиПоОбъектам(Объекты) Цикл
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(КлючИЗначение.Ключ);
		ДобавитьКонтекстТаблицы(Контекст, КлючИЗначение.Ключ, КлючИЗначение.Ключ, ОбъектМетаданных.Реквизиты,
			КлючИЗначение.Значение);
		Для Каждого ТабличнаяЧасть Из ОбъектМетаданных.ТабличныеЧасти Цикл
			ДобавитьКонтекстТаблицы(Контекст, КлючИЗначение.Ключ, КлючИЗначение.Ключ + "." + ТабличнаяЧасть.Имя,
				ТабличнаяЧасть.Реквизиты, КлючИЗначение.Значение);
		КонецЦикла;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Контекст;

КонецФункции

#Область Реестр

// Правила маскирования: преднастройка из макета ИИО_ПреднастройкаМаскирования для текущей конфигурации
// с изменениями из регистра ИИО_МаскируемыеПоля. Запись регистра с пустым полем задает вид ПДн представления
// ссылок и условие объекта, запись с пустым видом ПДн отключает маскирование поля.
// Для вызова используйте кэш сеанса ИИО_МаскированиеПовтИсп.Правила.
//
// Возвращаемое значение:
//  ФиксированноеСоответствие из КлючИЗначение:
//   * Ключ - Строка - Полное имя объекта метаданных.
//   * Значение - ФиксированнаяСтруктура:
//     ** ВидСсылки - Строка - Вид ПДн для представления ссылки или пустая строка.
//     ** Условие - Строка - Условие запроса с псевдонимом Т или пустая строка.
//     ** Поля - ФиксированноеСоответствие из КлючИЗначение - Имя поля и вид ПДн.
Функция ДействующиеПравила() Экспорт

	Правила = Преднастройка();
	Для Каждого Запись Из ЗаписиРегистра() Цикл
		Правило = Правила.Получить(Запись.Объект);
		Если Правило = Неопределено Тогда
			Правило = НовоеПравило();
			Правила.Вставить(Запись.Объект, Правило);
		КонецЕсли;
		Если Запись.Поле = "" Тогда
			Правило.ВидСсылки = Запись.ВидПДн;
			Правило.Условие = Запись.Условие;
		ИначеЕсли Запись.ВидПДн = "" Тогда
			Правило.Поля.Удалить(Запись.Поле);
		Иначе
			Правило.Поля.Вставить(Запись.Поле, Запись.ВидПДн);
		КонецЕсли;
	КонецЦикла;

	Результат = Новый Соответствие;
	Для Каждого КлючИЗначение Из Правила Цикл
		Правило = КлючИЗначение.Значение;
		Результат.Вставить(КлючИЗначение.Ключ, Новый ФиксированнаяСтруктура("ВидСсылки, Условие, Поля",
			Правило.ВидСсылки, Правило.Условие, Новый ФиксированноеСоответствие(Правило.Поля)));
	КонецЦикла;
	Возврат Новый ФиксированноеСоответствие(Результат);

КонецФункции

// Виды ПДн для выбора в форме настройки. Вид - имя токена, который увидит модель: [ФИО#3].
//
// Возвращаемое значение:
//  Массив из Строка
Функция ВидыПДн() Экспорт

	Возврат СтрРазделить("ФИО,ИНН,СНИЛС,Паспорт,Документ,Адрес,Контакт,Телефон,Email,ДатаРождения,ПДн", ",");

КонецФункции

// Правила для формы настройки: строка с пустым полем - представление ссылок и условие объекта,
// остальные - поля объекта. Значения преднастройки нужны форме, чтобы показать, что изменено.
//
// Возвращаемое значение:
//  Массив из Структура:
//   * Объект - Строка
//   * Поле - Строка
//   * ВидПДн - Строка
//   * Условие - Строка
//   * ВидПреднастройки - Строка
//   * УсловиеПреднастройки - Строка
//   * ЕстьВПреднастройке - Булево
Функция ПравилаДляНастройки() Экспорт

	Строки = Новый Соответствие;
	Для Каждого КлючИЗначение Из Преднастройка() Цикл
		Правило = КлючИЗначение.Значение;
		Если ЗначениеЗаполнено(Правило.ВидСсылки) Или ЗначениеЗаполнено(Правило.Условие) Тогда
			ДобавитьСтрокуНастройки(Строки, КлючИЗначение.Ключ, "", Правило.ВидСсылки, Правило.Условие, Истина);
		КонецЕсли;
		Для Каждого Поле Из Правило.Поля Цикл
			ДобавитьСтрокуНастройки(Строки, КлючИЗначение.Ключ, Поле.Ключ, Поле.Значение, "", Истина);
		КонецЦикла;
	КонецЦикла;
	Для Каждого Запись Из ЗаписиРегистра() Цикл
		СтрокаНастройки = Строки.Получить(Запись.Объект + "|" + Запись.Поле);
		Если СтрокаНастройки = Неопределено Тогда
			СтрокаНастройки = ДобавитьСтрокуНастройки(Строки, Запись.Объект, Запись.Поле, "", "", Ложь);
		КонецЕсли;
		СтрокаНастройки.ВидПДн = Запись.ВидПДн;
		СтрокаНастройки.Условие = Запись.Условие;
	КонецЦикла;

	Список = Новый СписокЗначений;
	Для Каждого КлючИЗначение Из Строки Цикл
		Список.Добавить(КлючИЗначение.Значение, КлючИЗначение.Ключ);
	КонецЦикла;
	Список.СортироватьПоПредставлению();
	Возврат Список.ВыгрузитьЗначения();

КонецФункции

// Записывает правила из формы настройки. В регистр попадают только отличия от преднастройки,
// поэтому обновление макета преднастройки не затирает изменения администратора.
//
// Параметры:
//  Строки - Массив из Структура - Объект, Поле, ВидПДн, Условие.
//
// Возвращаемое значение:
//  Массив из Строка - Ошибки проверки. При ошибках ничего не записывается.
Функция ЗаписатьПравила(Строки) Экспорт

	Если Не ИИО_Права.ЭтоАдминистраторИИОператора() Тогда
		ВызватьИсключение НСтр("ru = 'Правила маскирования меняет только администратор ИИ-оператора.'");
	КонецЕсли;
	Преднастройка = Преднастройка();
	Набор = РегистрыСведений.ИИО_МаскируемыеПоля.СоздатьНаборЗаписей();
	Ошибки = Новый Массив;
	Ключи = Новый Соответствие;
	Для Индекс = 0 По Строки.ВГраница() Цикл
		Объект = СокрЛП(Строки[Индекс].Объект);
		Поле = СокрЛП(Строки[Индекс].Поле);
		Вид = СокрЛП(Строки[Индекс].ВидПДн);
		Условие = СокрЛП(Строки[Индекс].Условие);
		Ошибка = ОшибкаПравила(Объект, Поле, Вид, Условие);
		Если Ошибка = "" И Ключи.Получить(Объект + "|" + Поле) <> Неопределено Тогда
			Ошибка = НСтр("ru = 'для этого поля правило уже есть выше.'");
		КонецЕсли;
		Если Ошибка <> "" Тогда
			Ошибки.Добавить(СтрШаблон(НСтр("ru = 'Строка %1 (%2): %3'"), Формат(Индекс + 1, "ЧГ=0"),
				?(Поле = "", Объект, Объект + "." + Поле), Ошибка));
			Продолжить;
		КонецЕсли;
		Ключи.Вставить(Объект + "|" + Поле, Истина);
		Если Не СовпадаетСПреднастройкой(Преднастройка, Объект, Поле, Вид, Условие) Тогда
			Запись = Набор.Добавить();
			Запись.Объект = Объект;
			Запись.Поле = Поле;
			Запись.ВидПДн = Вид;
			Запись.Условие = Условие;
		КонецЕсли;
	КонецЦикла;
	Если Ошибки.Количество() = 0 Тогда
		// Набор без отбора замещает весь регистр: удаленные из списка изменения возвращают преднастройку.
		Набор.Записать();
	КонецЕсли;
	Возврат Ошибки;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РеестрСлужебные

// Преднастройка ядра и пакетов (см. ИИО_Пакеты). Пакет добавляет объекты и поля; совпавшие поля
// объекта ядра он не меняет, чтобы пакет не мог ослабить маскирование ядра.
Функция Преднастройка()

	Правила = Новый Соответствие;
	ДобавитьПреднастройку(Правила, "ИИО_ПреднастройкаМаскирования");
	Для Каждого ИмяМакета Из ИИО_Пакеты.Макеты("_ПреднастройкаМаскирования") Цикл
		ДобавитьПреднастройку(Правила, ИмяМакета);
	КонецЦикла;
	Возврат Правила;

КонецФункции

Процедура ДобавитьПреднастройку(Правила, ИмяМакета)

	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ПолучитьОбщийМакет(ИмяМакета).ПолучитьТекст());
	Описания = ПрочитатьJSON(Чтение, Истина).Получить(Метаданные.Имя);
	Чтение.Закрыть();

	Если Описания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Для Каждого КлючИЗначение Из Описания Цикл
		Описание = КлючИЗначение.Значение;
		Правило = Правила.Получить(КлючИЗначение.Ключ);
		Если Правило = Неопределено Тогда
			Правило = НовоеПравило();
			Правило.ВидСсылки = Строка(?(Описание.Получить("ref") = Неопределено, "", Описание.Получить("ref")));
			Правило.Условие = Строка(?(Описание.Получить("condition") = Неопределено, "",
				Описание.Получить("condition")));
			Правила.Вставить(КлючИЗначение.Ключ, Правило);
		КонецЕсли;
		Поля = Описание.Получить("fields");
		Если Поля <> Неопределено Тогда
			Для Каждого Поле Из Поля Цикл
				Если Правило.Поля.Получить(Поле.Ключ) = Неопределено Тогда
					Правило.Поля.Вставить(Поле.Ключ, Строка(Поле.Значение));
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция НовоеПравило()

	Возврат Новый Структура("ВидСсылки, Условие, Поля", "", "", Новый Соответствие);

КонецФункции

// Возвращает изменения администратора из регистра ИИО_МаскируемыеПоля.
// Читаются в привилегированном режиме: правила нужны каждому пользователю ИИ-оператора.
//
// Возвращаемое значение:
//  Массив из Структура:
//   * Объект - Строка - Полное имя объекта метаданных.
//   * Поле - Строка - Имя поля или пустая строка для правила объекта.
//   * ВидПДн - Строка - Вид ПДн или пустая строка.
//   * Условие - Строка - Условие запроса с псевдонимом Т или пустая строка.
Функция ЗаписиРегистра()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МаскируемыеПоля.Объект КАК Объект,
	|	МаскируемыеПоля.Поле КАК Поле,
	|	МаскируемыеПоля.ВидПДн КАК ВидПДн,
	|	МаскируемыеПоля.Условие КАК Условие
	|ИЗ
	|	РегистрСведений.ИИО_МаскируемыеПоля КАК МаскируемыеПоля");
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	Записи = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Записи.Добавить(Новый Структура("Объект, Поле, ВидПДн, Условие",
			СокрЛП(Выборка.Объект), СокрЛП(Выборка.Поле), СокрЛП(Выборка.ВидПДн), СокрЛП(Выборка.Условие)));
	КонецЦикла;
	Возврат Записи;

КонецФункции

Функция ДобавитьСтрокуНастройки(Строки, Объект, Поле, Вид, Условие, ЕстьВПреднастройке)

	СтрокаНастройки = Новый Структура(
		"Объект, Поле, ВидПДн, Условие, ВидПреднастройки, УсловиеПреднастройки, ЕстьВПреднастройке",
		Объект, Поле, Вид, Условие, Вид, Условие, ЕстьВПреднастройке);
	Строки.Вставить(Объект + "|" + Поле, СтрокаНастройки);
	Возврат СтрокаНастройки;

КонецФункции

Функция СовпадаетСПреднастройкой(Преднастройка, Объект, Поле, Вид, Условие)

	Правило = Преднастройка.Получить(Объект);
	Если Правило = Неопределено Тогда
		// Пустое правило без преднастройки ничего не меняет.
		Возврат Вид = "" И Условие = "";
	ИначеЕсли Поле = "" Тогда
		Возврат Правило.ВидСсылки = Вид И Правило.Условие = Условие;
	КонецЕсли;
	ВидПреднастройки = Правило.Поля.Получить(Поле);
	Возврат ?(ВидПреднастройки = Неопределено, Вид = "", ВидПреднастройки = Вид);

КонецФункции

// Проверяет правило маскирования из формы настройки.
// Псевдоним таблицы Т в запросах с условием ПДн - часть формата условий: в преднастройке и регистре
// ИИО_МаскируемыеПоля условия записаны как Т.Поле. Поэтому он не заменяется более осмысленным (стандарт 758).
//
// Параметры:
//  Объект - Строка - Полное имя объекта метаданных, в том числе табличной части.
//  Поле - Строка - Имя поля или пустая строка для правила объекта.
//  Вид - Строка - Вид ПДн или пустая строка, если маскирование отключается.
//  Условие - Строка - Условие запроса с псевдонимом Т или пустая строка.
//
// Возвращаемое значение:
//  Строка - Текст ошибки для пользователя или пустая строка, если правило корректно.
Функция ОшибкаПравила(Объект, Поле, Вид, Условие)

	Если МетаданныеПоИмени(Объект) = Неопределено Тогда
		Возврат СтрШаблон(НСтр("ru = 'объект «%1» не найден: нужно полное имя, например Справочник.Контрагенты.'"),
			Объект);
	ИначеЕсли СтрДлина(Вид) > 50 Или СтрНайти(Вид, "|") > 0 Или СтрНайти(Вид, "#") > 0
		Или СтрНайти(Вид, "[") > 0 Или СтрНайти(Вид, "]") > 0 Тогда
		Возврат НСтр("ru = 'вид ПДн - короткое слово без символов | # [ ], например ФИО.'");
	ИначеЕсли Поле <> "" И Условие <> "" Тогда
		Возврат НСтр("ru = 'условие задается в строке объекта с пустым полем и действует на все его поля.'");
	ИначеЕсли Поле <> "" И Не ЗапросВыполняется(СтрШаблон("ВЫБРАТЬ ПЕРВЫЕ 1 Т.%1 ИЗ %2 КАК Т", Поле, Объект)) Тогда
		Возврат СтрШаблон(НСтр("ru = 'у объекта нет поля «%1».'"), Поле);
	ИначеЕсли Условие <> ""
		И Не ЗапросВыполняется(СтрШаблон("ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ %1 КАК Т ГДЕ %2", Объект, Условие)) Тогда
		Возврат НСтр("ru = 'условие не выполняется как запрос: нужно выражение языка запросов с псевдонимом Т,
			|например Т.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо).'");
	КонецЕсли;
	Возврат "";

КонецФункции

// Проверяет поле и условие выполнением запроса в привилегированном режиме: права администратора
// на сам объект не должны влиять на проверку.
//
// Параметры:
//  Текст - Строка - Текст проверочного запроса.
//
// Возвращаемое значение:
//  Булево - Истина, если запрос выполнился без ошибки.
Функция ЗапросВыполняется(Текст)

	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос(Текст);
	Попытка
		Запрос.Выполнить();
		Выполняется = Истина;
	Исключение
		Выполняется = Ложь;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Выполняется;

КонецФункции

#КонецОбласти

Процедура ДобавитьКонтекстТаблицы(Контекст, ПолноеИмяОбъекта, ИмяТаблицы, Реквизиты, Ссылки)

	Поля = Новый Соответствие;
	Для Каждого Реквизит Из Реквизиты Цикл
		Вид = ВидПДнПоля(ПолноеИмяОбъекта, Реквизит.Имя);
		Если ЗначениеЗаполнено(Вид) Или ЕстьСсылкиСПДн(Реквизит.Тип) Тогда
			Поля.Вставить(Реквизит.Имя, Вид);
		КонецЕсли;
	КонецЦикла;
	Если Поля.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ВыбираемыеПоля = Новый Массив;
	Для Каждого КлючИЗначение Из Поля Цикл
		ВыбираемыеПоля.Добавить(СтрШаблон("Объекты.%1 КАК %1", КлючИЗначение.Ключ));
	КонецЦикла;
	Запрос = Новый Запрос(СтрШаблон("ВЫБРАТЬ %1 ИЗ %2 КАК Объекты ГДЕ Объекты.Ссылка В (&Ссылки)",
		СтрСоединить(ВыбираемыеПоля, ", "), ИмяТаблицы));
	Запрос.УстановитьПараметр("Ссылки", Ссылки);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Для Каждого КлючИЗначение Из Поля Цикл
			Значение = Выборка[КлючИЗначение.Ключ];
			Если Не ЗначениеЗаполнено(Значение) Тогда
				Продолжить;
			ИначеЕсли ТипЗнч(Значение) = Тип("Строка") И ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
				Контекст.Добавить(Новый Структура("pii, value", КлючИЗначение.Значение, Значение));
			ИначеЕсли ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Значение))
				И ЗначениеЗаполнено(ВидПДнСсылки(Значение.Метаданные().ПолноеИмя()))
				И Контекст.Найти(Значение) = Неопределено Тогда
				Контекст.Добавить(Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Функция ЕстьСсылкиСПДн(ОписаниеТипов)

	Для Каждого Тип Из ОписаниеТипов.Типы() Цикл
		ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
		Если ОбъектМетаданных <> Неопределено И ЗначениеЗаполнено(ВидПДнСсылки(ОбъектМетаданных.ПолноеИмя())) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;

КонецФункции

// Возвращает объект метаданных по полному имени, в том числе табличную часть:
// Справочник.Контрагенты.КонтактнаяИнформация.
//
// Параметры:
//  ПолноеИмя - Строка - Полное имя объекта или табличной части.
//
// Возвращаемое значение:
//  ОбъектМетаданных, Неопределено - Неопределено, если объект не найден.
Функция МетаданныеПоИмени(ПолноеИмя)

	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
	Части = СтрРазделить(ПолноеИмя, ".");
	Если ОбъектМетаданных = Неопределено И Части.Количество() = 3 Тогда
		Владелец = Метаданные.НайтиПоПолномуИмени(Части[0] + "." + Части[1]);
		Попытка
			ОбъектМетаданных = ?(Владелец = Неопределено, Неопределено, Владелец.ТабличныеЧасти.Найти(Части[2]));
		Исключение
			// У владельца нет табличных частей (регистр).
			ОбъектМетаданных = Неопределено;
		КонецПопытки;
	КонецЕсли;
	Возврат ОбъектМетаданных;

КонецФункции

Функция УсловныйВидПДн(Вид, ПолноеИмяОбъекта, ИмяПоля)

	Возврат СтрШаблон("%1|%2|%3", Вид, ПолноеИмяОбъекта, ИмяПоля);

КонецФункции

Функция ЭтоУсловныйВид(Вид)

	Возврат СтрНайти(Вид, "|") > 0;

КонецФункции

Процедура СобратьУсловныеПометки(Данные, Пометки)

	Тип = ТипЗнч(Данные);
	Если Тип = Тип("Структура") Или Тип = Тип("Соответствие") Тогда
		Для Каждого КлючИЗначение Из Данные Цикл
			ДобавитьУсловнуюПометку(Данные, КлючИЗначение.Ключ, КлючИЗначение.Значение, Пометки);
		КонецЦикла;
	ИначеЕсли Тип = Тип("Массив") Тогда
		Для Индекс = 0 По Данные.ВГраница() Цикл
			ДобавитьУсловнуюПометку(Данные, Индекс, Данные[Индекс], Пометки);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

// Добавляет пометку {"pii", "value"} с условным видом в список проверки или обходит вложенные данные.
// Строковое значение с условным видом ждет проверки по значению, у остальных типов остается основной вид.
//
// Параметры:
//  Контейнер - Структура, Соответствие, Массив - Коллекция, в которой лежит значение.
//  Ключ - Произвольный - Ключ структуры или соответствия либо индекс массива.
//  Значение - Произвольный - Проверяемое значение.
//  Пометки - Массив из Структура - Собранные пометки, пополняется:
//   * Контейнер - Структура, Соответствие, Массив
//   * Ключ - Произвольный
//   * Вид - Строка - Условный вид ПДн.
//   * Значение - Строка
Процедура ДобавитьУсловнуюПометку(Контейнер, Ключ, Значение, Пометки)

	Если ТипЗнч(Значение) = Тип("Структура") И Значение.Свойство("pii") И Значение.Свойство("value")
		И ЭтоУсловныйВид(Значение.pii) Тогда
		Если ТипЗнч(Значение.value) = Тип("Строка") Тогда
			Пометки.Добавить(Новый Структура("Контейнер, Ключ, Вид, Значение",
				Контейнер, Ключ, Значение.pii, Значение.value));
		Иначе
			Значение.pii = ОсновнойВидПДн(Значение.pii);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	СобратьУсловныеПометки(Значение, Пометки);

КонецПроцедуры

// Возвращает значения поля, которые встречаются только у объектов, не подходящих под условие ПДн.
//
// Параметры:
//  ПолноеИмя - Строка - Полное имя объекта с условием ПДн.
//  ИмяПоля - Строка - Имя строкового поля объекта.
//  Значения - Массив из Строка - Значения условных пометок этого вида.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - Строка - Открытое значение.
//   * Значение - Булево - Истина.
Функция ОткрытыеЗначения(ПолноеИмя, ИмяПоля, Значения)

	Открытые = Новый Соответствие;
	Правило = ИИО_МаскированиеПовтИсп.Правила().Получить(ПолноеИмя);
	ДлинаПоля = ДлинаСтроковогоПоля(ПолноеИмя, ИмяПоля);
	Если Правило = Неопределено Или Не ЗначениеЗаполнено(Правило.Условие) Или ДлинаПоля = Неопределено Тогда
		Возврат Открытые;
	КонецЕсли;
	// Строку неограниченной длины нельзя сравнивать и группировать, поэтому она приводится к ограниченной.
	// Псевдоним Т - из формата условий ПДн, см. ОшибкаПравила.
	Поле = ?(ДлинаПоля = 0, СтрШаблон("ВЫРАЗИТЬ(Т.%1 КАК СТРОКА(1024))", ИмяПоля), "Т." + ИмяПоля);

	Запрос = Новый Запрос(СтрШаблон(
		"ВЫБРАТЬ
		|	%1 КАК Значение,
		|	МАКСИМУМ(ВЫБОР КОГДА %3 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ЕстьПДн
		|ИЗ
		|	%2 КАК Т
		|ГДЕ
		|	%1 В (&Значения)
		|СГРУППИРОВАТЬ ПО
		|	%1", Поле, ПолноеИмя, Правило.Условие));
	Запрос.УстановитьПараметр("Значения", Значения);
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЕстьПДн = 0 Тогда
			Открытые.Вставить(Выборка.Значение, Истина);
		КонецЕсли;
	КонецЦикла;
	Возврат Открытые;

КонецФункции

// Возвращает длину строкового поля объекта.
//
// Параметры:
//  ПолноеИмя - Строка - Полное имя объекта или табличной части.
//  ИмяПоля - Строка - Имя реквизита или стандартного реквизита.
//
// Возвращаемое значение:
//  Число, Неопределено - 0 - неограниченная длина, Неопределено - поля нет или оно не только строковое.
Функция ДлинаСтроковогоПоля(ПолноеИмя, ИмяПоля)

	ОбъектМетаданных = МетаданныеПоИмени(ПолноеИмя);
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ТипПоля = Неопределено;
	Реквизит = ОбъектМетаданных.Реквизиты.Найти(ИмяПоля);
	Если Реквизит <> Неопределено Тогда
		ТипПоля = Реквизит.Тип;
	Иначе
		Для Каждого СтандартныйРеквизит Из ОбъектМетаданных.СтандартныеРеквизиты Цикл
			Если СтандартныйРеквизит.Имя = ИмяПоля Тогда
				ТипПоля = СтандартныйРеквизит.Тип;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если ТипПоля = Неопределено Или ТипПоля.Типы().Количество() <> 1 Или Не ТипПоля.СодержитТип(Тип("Строка")) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат ТипПоля.КвалификаторыСтроки.Длина;

КонецФункции

Функция СсылкиПоОбъектам(Ссылки)

	Группы = Новый Соответствие;
	Для Каждого Ссылка Из Ссылки Цикл
		Если Не ЗначениеЗаполнено(Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		ПолноеИмя = Ссылка.Метаданные().ПолноеИмя();
		Группа = Группы.Получить(ПолноеИмя);
		Если Группа = Неопределено Тогда
			Группа = Новый Массив;
			Группы.Вставить(ПолноеИмя, Группа);
		КонецЕсли;
		Если Группа.Найти(Ссылка) = Неопределено Тогда
			Группа.Добавить(Ссылка);
		КонецЕсли;
	КонецЦикла;
	Возврат Группы;

КонецФункции

// Ссылки, для которых условие ПДн точно не выполняется. Запрос с РАЗРЕШЕННЫЕ:
// ссылки, которые пользователь не может прочитать, в результат не попадут и будут замаскированы.
// Псевдоним Т - из формата условий ПДн, см. ОшибкаПравила.
Функция СсылкиБезПДн(ПолноеИмя, Условие, Ссылки)

	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон("ВЫБРАТЬ РАЗРЕШЕННЫЕ Т.Ссылка КАК Ссылка ИЗ %1 КАК Т ГДЕ Т.Ссылка В (&Ссылки) И НЕ (%2)",
		ПолноеИмя, Условие);
	Запрос.УстановитьПараметр("Ссылки", Ссылки);

	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Ссылка, Истина);
	КонецЦикла;
	Возврат Результат;

КонецФункции

#КонецОбласти
